cylinder-flap-3d/OpenFOAM-CalculiX/Fluid/0.orig/vorticity
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    flap
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
